packages/nodejs-express/results.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ../../script.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 43s max duration (incl. graceful stop):
              * delayed_start: 10 looping VUs for 10s (startTime: 3s, gracefulStop: 30s)


running (01.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
delayed_start • [   0% ] waiting  2.0s

running (02.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
delayed_start • [   0% ] waiting  1.0s

running (03.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
delayed_start • [   0% ] waiting  0.0s

running (04.0s), 10/10 VUs, 2013 complete and 0 interrupted iterations
delayed_start   [  10% ] 10 VUs  01.0s/10s

running (05.0s), 10/10 VUs, 5522 complete and 0 interrupted iterations
delayed_start   [  20% ] 10 VUs  02.0s/10s

running (06.0s), 10/10 VUs, 8989 complete and 0 interrupted iterations
delayed_start   [  30% ] 10 VUs  03.0s/10s

running (07.0s), 10/10 VUs, 12523 complete and 0 interrupted iterations
delayed_start   [  40% ] 10 VUs  04.0s/10s

running (08.0s), 10/10 VUs, 15704 complete and 0 interrupted iterations
delayed_start   [  50% ] 10 VUs  05.0s/10s

running (09.0s), 10/10 VUs, 19063 complete and 0 interrupted iterations
delayed_start   [  60% ] 10 VUs  06.0s/10s

running (10.0s), 10/10 VUs, 22756 complete and 0 interrupted iterations
delayed_start   [  70% ] 10 VUs  07.0s/10s

running (11.0s), 10/10 VUs, 26266 complete and 0 interrupted iterations
delayed_start   [  80% ] 10 VUs  08.0s/10s

running (12.0s), 10/10 VUs, 29898 complete and 0 interrupted iterations
delayed_start   [  90% ] 10 VUs  09.0s/10s

running (13.0s), 10/10 VUs, 32946 complete and 0 interrupted iterations
delayed_start ↓ [ 100% ] 10 VUs  10s

     data_received..................: 25 MB  1.9 MB/s
     data_sent......................: 2.6 MB 203 kB/s
     http_req_blocked...............: avg=2.8µs   min=661ns    med=1.89µs  max=1.98ms  p(90)=2.23µs  p(95)=2.75µs 
     http_req_connecting............: avg=139ns   min=0s       med=0s      max=1.36ms  p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=2.96ms  min=297.41µs med=2.22ms  max=35.95ms p(90)=4.49ms  p(95)=5.58ms 
       { expected_response:true }...: avg=2.96ms  min=297.41µs med=2.22ms  max=35.95ms p(90)=4.49ms  p(95)=5.58ms 
     http_req_failed................: 0.00%  ✓ 0           ✗ 32956
     http_req_receiving.............: avg=39.16µs min=11.67µs  med=28.61µs max=8.01ms  p(90)=51.25µs p(95)=58.12µs
     http_req_sending...............: avg=13.11µs min=3.24µs   med=8.09µs  max=7.97ms  p(90)=9.63µs  p(95)=32.07µs
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s      max=0s      p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=2.91ms  min=267.13µs med=2.17ms  max=35.88ms p(90)=4.44ms  p(95)=5.51ms 
     http_reqs......................: 32956  2533.309844/s
     iteration_duration.............: avg=3.02ms  min=339.79µs med=2.28ms  max=37.44ms p(90)=4.56ms  p(95)=5.65ms 
     iterations.....................: 32956  2533.309844/s
     vus............................: 10     min=0         max=10 
     vus_max........................: 10     min=10        max=10 


running (13.0s), 00/10 VUs, 32956 complete and 0 interrupted iterations
delayed_start ✓ [ 100% ] 10 VUs  10s