packages/nodejs-express/results.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ../../script.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 43s max duration (incl. graceful stop):
              * delayed_start: 10 looping VUs for 10s (startTime: 3s, gracefulStop: 30s)


running (01.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
delayed_start • [   0% ] waiting  2.0s

running (02.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
delayed_start • [   0% ] waiting  1.0s

running (03.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
delayed_start • [   0% ] waiting  0.0s

running (04.0s), 10/10 VUs, 13532 complete and 0 interrupted iterations
delayed_start   [  10% ] 10 VUs  01.0s/10s

running (05.0s), 10/10 VUs, 30522 complete and 0 interrupted iterations
delayed_start   [  20% ] 10 VUs  02.0s/10s

running (06.0s), 10/10 VUs, 46957 complete and 0 interrupted iterations
delayed_start   [  30% ] 10 VUs  03.0s/10s

running (07.0s), 10/10 VUs, 63886 complete and 0 interrupted iterations
delayed_start   [  40% ] 10 VUs  04.0s/10s

running (08.0s), 10/10 VUs, 80611 complete and 0 interrupted iterations
delayed_start   [  50% ] 10 VUs  05.0s/10s

running (09.0s), 10/10 VUs, 97722 complete and 0 interrupted iterations
delayed_start   [  60% ] 10 VUs  06.0s/10s

running (10.0s), 10/10 VUs, 114725 complete and 0 interrupted iterations
delayed_start   [  70% ] 10 VUs  07.0s/10s

running (11.0s), 10/10 VUs, 131896 complete and 0 interrupted iterations
delayed_start   [  80% ] 10 VUs  08.0s/10s

running (12.0s), 10/10 VUs, 149203 complete and 0 interrupted iterations
delayed_start   [  90% ] 10 VUs  09.0s/10s

running (13.0s), 10/10 VUs, 165828 complete and 0 interrupted iterations
delayed_start   [ 100% ] 10 VUs  10.0s/10s

     data_received..................: 127 MB 9.8 MB/s
     data_sent......................: 13 MB  1.0 MB/s
     http_req_blocked...............: avg=506ns    min=0s      med=0s       max=2.39ms  p(90)=1µs     p(95)=1µs   
     http_req_connecting............: avg=59ns     min=0s      med=0s       max=2.34ms  p(90)=0s      p(95)=0s    
     http_req_duration..............: avg=589.77µs min=86µs    med=490µs    max=27.58ms p(90)=957µs   p(95)=1.03ms
       { expected_response:true }...: avg=589.77µs min=86µs    med=490µs    max=27.58ms p(90)=957µs   p(95)=1.03ms
     http_req_failed................: 0.00%  ✓ 0            ✗ 165858
     http_req_receiving.............: avg=7.94µs   min=4µs     med=7µs      max=2.53ms  p(90)=11µs    p(95)=13µs  
     http_req_sending...............: avg=1.78µs   min=1µs     med=1µs      max=1.4ms   p(90)=2µs     p(95)=3µs   
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s      p(90)=0s      p(95)=0s    
     http_req_waiting...............: avg=580.05µs min=74µs    med=482µs    max=27.52ms p(90)=948µs   p(95)=1.02ms
     http_reqs......................: 165858 12757.691398/s
     iteration_duration.............: avg=600.48µs min=97.95µs med=500.37µs max=30.43ms p(90)=967.2µs p(95)=1.04ms
     iterations.....................: 165858 12757.691398/s
     vus............................: 10     min=0          max=10  
     vus_max........................: 10     min=10         max=10  


running (13.0s), 00/10 VUs, 165858 complete and 0 interrupted iterations
delayed_start ✓ [ 100% ] 10 VUs  10s